In [ ]:
##Pandas Assignment

In [ ]:
##Ques 1: Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [6]:
import pandas as pd

In [7]:
data=[4,8,15,16,23,42]

In [48]:
sr=pd.Series(data)

In [8]:
df=pd.DataFrame(data,columns=['input'])

In [14]:
df

   input
0      4
1      8
2     15
3     16
4     23
5     42

In [49]:
sr

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [16]:
df.dtypes

input    int64
dtype: object

In [50]:
sr.dtypes

dtype('int64')

In [17]:
print(df)

   input
0      4
1      8
2     15
3     16
4     23
5     42

In [51]:
print(sr)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [19]:
##Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [20]:
data1=[1,'bish',2,2.5,4,5,6,8,9,10]

In [23]:
df2=pd.Series(data1)

In [24]:
print(df2)

0       1
1    bish
2       2
3     2.5
4       4
5       5
6       6
7       8
8       9
9      10
dtype: object

In [25]:
##Q3. Create a Pandas DataFrame that contains the following data:

In [26]:
data3=[['Alice',25,'Female'],['Bob',30,'Male'],['Claire',27,'Female']]

In [27]:
df3=pd.DataFrame(data3,columns=['Name','Age','Gender'])

In [28]:
print(df3)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
##Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
##Ans: A dataframe is a data format that can store data in a form of a table,i.e., containing multiple rows and multiple columns. Series on the other hand is a sub-set of dataframe and more like a list of data values and essentially composing of only a single column with indexes present across the rows.

In [ ]:
##E.g-If we consider the df3 dataframe from ques 3, the entire dataframe is of type dataframe

In [33]:
df3.dtypes

Name      object
Age        int64
Gender    object
dtype: object

In [ ]:
##If we see the data type of only one column, then it would be a series

In [36]:
df3['Age'].dtypes

dtype('int64')

In [ ]:
##Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [ ]:
##Answer: Some common functions would be:
##dtypes-use to check the data types of all columns of the dataframe
##head-use to see the data points of the dataframe starting from the top
##tail-use to see the data points of the dataframe starting from the bottom
##columns-use to see all the column names

In [37]:
##Example: To see the first row of data for the dataframe df3, we can use the head function

In [38]:
df3.head(1)

    Name  Age  Gender
0  Alice   25  Female

In [39]:
##Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
#Ans: DataFrames are both value and size-mutable (A Series, by contrast, is only value-mutable, not size-mutable. The length of a Series cannot be changed although the values can be changed)

In [ ]:
##Q7. Create a DataFrame using multiple Series. Explain with an example.

In [40]:
data4=[1,2,3,4]

In [41]:
data5=['a','e','i','o']

In [42]:
sr1=pd.Series(data4)

In [43]:
sr2=pd.Series(data5)

In [44]:
sr1

0    1
1    2
2    3
3    4
dtype: int64

In [45]:
sr2

0    a
1    e
2    i
3    o
dtype: object

In [46]:
df5=pd.DataFrame([sr1,sr2])

In [47]:
df5

   0  1  2  3
0  1  2  3  4
1  a  e  i  o

In [ ]:
##We created two series and then made a dataframe by combining the two (as shown above)